package homework_19;
/*
Класс "Счётчик" Разработайте класс Counter, который позволяет
создавать объекты-счётчики с возможностью увеличения и уменьшения значения
счётчика. В классе должны быть:

Поле value для хранения текущего значения счётчика.
Методы increment() и decrement(), увеличивающие и уменьшающие
значение счётчика соответственно.
Метод getValue() для получения текущего значения счётчика.
 */
public class Counter {

    private int value; // Поле для хранения текущего значения счетчика

    // Конструктор для инициализации счетчика с начальным значением
    public Counter(int initialValue) {
        this.value = initialValue;
    }

    // Метод для увеличения значения счетчика на 1
    public void increment() {
        value++;
    }

    // Метод для уменьшения значения счетчика на 1
    public void decrement() {
        value--;
    }

    // Метод для получения текущего значения счетчика
    public int getValue() {
        return value;
    }


}
